from random import randint

surnames = [
    'Иванов', 'Петров', 'Сидоров', 'Кузнецов', 'Попов', 'Васильев', 'Михайлов', 'Новиков', 'Федоров', 'Смирнов',
    'Ковалев', 'Тимофеев', 'Романов', 'Захаров', 'Григорьев', 'Козлов', 'Орлов', 'Соколов', 'Макаров', 'Кириллов',
    'Морозов', 'Дмитриев', 'Александров', 'Чернов', 'Соловьев', 'Гончаров', 'Беляев', 'Денисов', 'Герасимов',
    'Крылов', 'Тимуров', 'Шмидт', 'Лебедев', 'Калинин', 'Медведев', 'Ермаков', 'Курочкин', 'Баранов', 'Ширяев',
    'Лукичев', 'Панков'
]

for i in range(35):
    duration = str(randint(1, 60))
    price = str(randint(1, 40))
    surname = surnames[i]
    print(f"INSERT INTO abonents (surname, duration, price) VALUES ('{surname}', {duration}, {price});")